<?php
// +----------------------------------------------------------------------
// | LubTMP 售票类
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.leubao.com, All rights reserved.
// +----------------------------------------------------------------------
// | Author: zhoujing <admin@leubao.com>
// +----------------------------------------------------------------------
namespace Api\Service;
use Common\Model\Model;
class Saleticket{
	/*剧院票务类*/
	function 
}