<?php
// +----------------------------------------------------------------------
// | LubTMP  票务系统自动检测程序
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.leubao.com, All rights reserved.
// +----------------------------------------------------------------------
// | Author: zhoujing <admin@leubao.com>
// +----------------------------------------------------------------------
namespace CronScript;
use Libs\Service\Check;
class LubTMPAutoCheck {
	/*计划任务错误代码
	*130001 订单查询失败
	*/
    //任务主体
    public function run($cronId) {
    	//检测过期场次是否有效
    	Check::check_plan();
    	//全面检测扣款、返利、退单是否成功
        
    	//检测各终端自助设备是否正常
    }
}